tap "felixkratz/formulae"

# Symlinks
brew "stow"

# Fuzzy finder / search
brew "fd"
brew "fzf"
brew "rg"

# Terminal
brew "zsh"
brew "antidote"
brew "tmux"
brew "neovim"
brew "starship"

# Git and Github
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"

# Languages / Package Managers
brew "cmake"
brew "dotnet"
brew "luarocks"
brew "npm"
brew "pipx"
brew "rustup"

# Modern CLI replacements / additions
brew "bat"
brew "eza"
brew "zoxide"
brew "btop"
brew "tealdeer"
brew "atuin"
brew "mas"

# Fonts
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "sf-symbols"

# Apps
cask "1password"
cask "alacritty"
cask "betterdisplay"
cask "bruno"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "karabiner-elements"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "wezterm"
