tap "felixkratz/formulae"
tap "nikitabobko/tap"

# Symlinks
brew "stow"

# Window manager extras
brew "borders"

# Fuzzy finder / search
brew "fd"
brew "fzf"
brew "ripgrep"

# Terminal
brew "zsh"
brew "antidote"
brew "tmux"
brew "tmux-sessionizer"
brew "neovim"
brew "starship"

# Git and Github
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"

# Languages / Package Managers
brew "cmake"
brew "dotnet"
brew "go"
brew "luarocks"
brew "node"
brew "odin"
brew "pipx"
brew "rust-analyzer"
brew "rustup"

# Modern CLI replacements / additions
brew "bat"
brew "eza"
brew "zoxide"
brew "btop"
brew "tealdeer"
brew "atuin"
brew "mas"

# Fonts
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "sf-symbols"

# Apps
cask "1password"
cask "betterdisplay"
cask "bruno"
cask "claude-code"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "krita"
cask "linearmouse"
cask "logi-options+"
cask "love"
cask "obsidian"
cask "sol"
cask "aerospace"
cask "rectangle"
cask "spotify"
cask "wezterm"
